package Lesson_3_Homework;

public class Task_1 {
    public static void main(String[] args) {

        // Домашка
        // Базовый уровень
        // Задание №1 - Написать цикл, который выводит через пробел 100 чисел с приставкой "a".
        // Ожидаемый результат: 1а 2а 3а .. 100а

        int i = 0;
        for (i = 0; i <= 100; i++)
            System.out.print(i + "a ");

    }
}